In [3]:
import pandas as pd

In [5]:
df =pd.read_csv("Salaries.csv")

In [26]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [18]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [24]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [11]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [13]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [30]:
df.columns  # to find the column names in pandas

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [36]:
df.dtypes # gives the data types of all the columns " object " is just for string and "int64 is for the numbers"

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [38]:
df["rank"]

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [40]:
df.head(5)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [44]:
df["rank"]

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [50]:
df[["rank","phd"]]

         rank  phd
0        Prof   56
1        Prof   12
2        Prof   23
3        Prof   40
4        Prof   20
..        ...  ...
73       Prof   18
74  AssocProf   19
75       Prof   17
76       Prof   28
77       Prof   23

[78 rows x 2 columns]

In [52]:
df[["rank","phd","sex"]]

         rank  phd     sex
0        Prof   56    Male
1        Prof   12    Male
2        Prof   23    Male
3        Prof   40    Male
4        Prof   20    Male
..        ...  ...     ...
73       Prof   18  Female
74  AssocProf   19  Female
75       Prof   17  Female
76       Prof   28  Female
77       Prof   23  Female

[78 rows x 3 columns]

In [56]:
df["rank"].describe()

count       78
unique       3
top       Prof
freq        46
Name: rank, dtype: object

In [58]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [60]:
df.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [64]:
df.max() # gives the maximum value for each column

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [66]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [68]:
df.phd.min()

1

In [70]:
df.phd.max()

56

# quantile()

In [75]:
df.phd.quantile(0.25) # gives the 25% of the data from the phd column

10.25

In [81]:
new_df =df.describe()

In [83]:
new_df

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [91]:
df[["salary","service"]].quantile(0.25)

salary     88612.50
service        5.25
Name: 0.25, dtype: float64

In [95]:
df.service.std() #gives standard variance of the service column

12.139767682042327

In [103]:
df["discipline"].value_counts() # gives the uniq values from the discipline column a =36 and b =42

discipline
B    42
A    36
Name: count, dtype: int64

In [206]:
df.groupby(["rank","discipline"]).salary.mean()

rank       discipline
AssocProf  A              73959.800000
           B             102927.750000
AsstProf   A              74450.000000
           B              86390.272727
Prof       A             111935.695652
           B             135313.913043
Name: salary, dtype: float64

In [111]:
df.groupby(["salary"]).count()

        rank  discipline  phd  service  sex
salary
57800      1           1    1        1    1
62884      1           1    1        1    1
63100      1           1    1        1    1
71065      1           1    1        1    1
72500      2           2    2        2    2
...      ...         ...  ...      ...  ...
155750     1           1    1        1    1
155865     1           1    1        1    1
161101     1           1    1        1    1
162200     1           1    1        1    1
186960     1           1    1        1    1

[73 rows x 5 columns]

In [117]:
df.groupby(["salary"]).salary.count().tail()

salary
155750    1
155865    1
161101    1
162200    1
186960    1
Name: salary, dtype: int64

In [119]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [200]:
df.groupby("rank").salary.count()

rank
AssocProf    13
AsstProf     19
Prof         46
Name: salary, dtype: int64

In [131]:
df.groupby("discipline").count()

            rank  phd  service  sex  salary
discipline
A             36   36       36   36      36
B             42   42       42   42      42

In [135]:
df[df.salary>120000].head(5)

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
3   Prof          A   40       31  Male  131205
5   Prof          A   20       20  Male  122400
7   Prof          A   18       18  Male  126300
10  Prof          B   39       33  Male  128250

In [139]:
df[df.salary>12000].head(5)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [147]:
df[df["salary"]>120000].shape[0] # gives the count of rows whose salary is greater than 1.2 lakh

25

In [163]:
new_cf =df[(df["sex"]=="male ") & (df["salary"] >120000)]

In [165]:
new_cf

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []

In [161]:
df[(df["sex"]=="male ") & (df["salary"] >120000)]

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []

In [167]:
df[df["sex"]=="male"]

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []

In [169]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [175]:
df.groupby("rank").salary.count()

rank
AssocProf    13
AsstProf     19
Prof         46
Name: salary, dtype: int64

In [204]:
df["rank"].value_counts()

rank
Prof         46
AsstProf     19
AssocProf    13
Name: count, dtype: int64

# iloc method =for rows

In [182]:
df.iloc[77] # gives 77 record of all column

rank            Prof
discipline         A
phd               23
service           15
sex           Female
salary        109646
Name: 77, dtype: object

In [186]:
df.iloc[0:2,] #df.iloc[rows:columns]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [190]:
df.iloc[ :,4] #gives on;y 4th column

0       Male
1       Male
2       Male
3       Male
4       Male
       ...
73    Female
74    Female
75    Female
76    Female
77    Female
Name: sex, Length: 78, dtype: object

In [194]:
df.iloc[0:6,0:5]

   rank discipline  phd  service   sex
0  Prof          B   56       49  Male
1  Prof          A   12        6  Male
2  Prof          A   23       20  Male
3  Prof          A   40       31  Male
4  Prof          B   20       18  Male
5  Prof          A   20       20  Male

In [198]:
df.iloc[[10,20,21,22]] # to accesss the particular row

        rank discipline  phd  service   sex  salary
10      Prof          B   39       33  Male  128250
20  AsstProf          B    4        4  Male   92000
21      Prof          A   33       30  Male  103106
22  AsstProf          A    4        2  Male   73000

In [208]:
from math import exp

In [210]:
exp(2)

7.38905609893065

In [212]:
exp(1)

2.718281828459045